bigtreetech/BIGTREETECH-OCTOPUS-V1.0/Firmware/RepRapFirmware/RRFBuild-SourceCode/CoreN2G/src/atmel/SAMC21_DFP/1.2.176/samc21/atdf/ATSAMC21J17A.atdf
          <instance name="SERCOM2">
            <register-group name="SERCOM2" name-in-module="SERCOM" address-space="base" offset="0x42000C00"/>
            <signals>
              <signal group="PAD" index="0" function="D" pad="PA08"/>
              <signal group="PAD" index="0" function="C" pad="PA12"/>
              <signal group="PAD" index="1" function="D" pad="PA09"/>
              <signal group="PAD" index="1" function="C" pad="PA13"/>
              <signal group="PAD" index="2" function="D" pad="PA10"/>
              <signal group="PAD" index="2" function="C" pad="PA14"/>
              <signal group="PAD" index="3" function="D" pad="PA11"/>
              <signal group="PAD" index="3" function="C" pad="PA15"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_RX" value="6" caption="Index of DMA RX trigger"/>
              <param name="DMAC_ID_TX" value="7" caption="Index of DMA TX trigger"/>
              <param name="GCLK_ID_CORE" value="21"/>
              <param name="GCLK_ID_SLOW" value="18"/>
              <param name="INT_MSB" value="6"/>
              <param name="PMSB" value="3"/>
              <param name="INSTANCE_ID" value="67"/>
            </parameters>
          </instance>
          <instance name="SERCOM3">
            <register-group name="SERCOM3" name-in-module="SERCOM" address-space="base" offset="0x42001000"/>
            <signals>
              <signal group="PAD" index="0" function="D" pad="PA16"/>
              <signal group="PAD" index="0" function="C" pad="PA22"/>
              <signal group="PAD" index="1" function="D" pad="PA17"/>
              <signal group="PAD" index="1" function="C" pad="PA23"/>
              <signal group="PAD" index="2" function="D" pad="PA18"/>
              <signal group="PAD" index="2" function="D" pad="PA20"/>
              <signal group="PAD" index="2" function="C" pad="PA24"/>
              <signal group="PAD" index="3" function="D" pad="PA19"/>
              <signal group="PAD" index="3" function="D" pad="PA21"/>
              <signal group="PAD" index="3" function="C" pad="PA25"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_RX" value="8" caption="Index of DMA RX trigger"/>
              <param name="DMAC_ID_TX" value="9" caption="Index of DMA TX trigger"/>
              <param name="GCLK_ID_CORE" value="22"/>
              <param name="GCLK_ID_SLOW" value="18"/>
              <param name="INT_MSB" value="6"/>
              <param name="PMSB" value="3"/>
              <param name="INSTANCE_ID" value="68"/>
            </parameters>
          </instance>
          <instance name="SERCOM4">
            <register-group name="SERCOM4" name-in-module="SERCOM" address-space="base" offset="0x42001400"/>
            <signals>
              <signal group="PAD" index="0" function="D" pad="PA12"/>
              <signal group="PAD" index="0" function="D" pad="PB08"/>
              <signal group="PAD" index="0" function="C" pad="PB12"/>
              <signal group="PAD" index="1" function="D" pad="PA13"/>
              <signal group="PAD" index="1" function="D" pad="PB09"/>
              <signal group="PAD" index="1" function="C" pad="PB13"/>
              <signal group="PAD" index="2" function="D" pad="PA14"/>
              <signal group="PAD" index="2" function="D" pad="PB10"/>
              <signal group="PAD" index="2" function="C" pad="PB14"/>
              <signal group="PAD" index="3" function="D" pad="PA15"/>
              <signal group="PAD" index="3" function="D" pad="PB11"/>
              <signal group="PAD" index="3" function="C" pad="PB15"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_RX" value="10" caption="Index of DMA RX trigger"/>
              <param name="DMAC_ID_TX" value="11" caption="Index of DMA TX trigger"/>
              <param name="GCLK_ID_CORE" value="23"/>
              <param name="GCLK_ID_SLOW" value="18"/>
              <param name="INT_MSB" value="6"/>
              <param name="PMSB" value="3"/>
              <param name="INSTANCE_ID" value="69"/>
            </parameters>
          </instance>
          <instance name="SERCOM5">
            <register-group name="SERCOM5" name-in-module="SERCOM" address-space="base" offset="0x42001800"/>
            <signals>
              <signal group="PAD" index="0" function="D" pad="PA22"/>
              <signal group="PAD" index="0" function="D" pad="PB02"/>
              <signal group="PAD" index="0" function="D" pad="PB30"/>
              <signal group="PAD" index="0" function="C" pad="PB16"/>
              <signal group="PAD" index="1" function="D" pad="PA23"/>
              <signal group="PAD" index="1" function="D" pad="PB03"/>
              <signal group="PAD" index="1" function="D" pad="PB31"/>
              <signal group="PAD" index="1" function="C" pad="PB17"/>
              <signal group="PAD" index="2" function="D" pad="PA24"/>
              <signal group="PAD" index="2" function="D" pad="PB00"/>
              <signal group="PAD" index="2" function="D" pad="PB22"/>
              <signal group="PAD" index="2" function="C" pad="PA20"/>
              <signal group="PAD" index="3" function="D" pad="PA25"/>
              <signal group="PAD" index="3" function="D" pad="PB01"/>
              <signal group="PAD" index="3" function="D" pad="PB23"/>
              <signal group="PAD" index="3" function="C" pad="PA21"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_RX" value="12" caption="Index of DMA RX trigger"/>
              <param name="DMAC_ID_TX" value="13" caption="Index of DMA TX trigger"/>
              <param name="GCLK_ID_CORE" value="25"/>
              <param name="GCLK_ID_SLOW" value="24"/>
              <param name="INT_MSB" value="6"/>
              <param name="PMSB" value="3"/>
              <param name="INSTANCE_ID" value="70"/>
            </parameters>
          </instance>
        </module>
        <module name="SUPC" id="U2117" version="2.1.1">
          <instance name="SUPC">
            <register-group name="SUPC" name-in-module="SUPC" address-space="base" offset="0x40001800"/>
            <signals>
              <signal group="BGBUFREADY" index="0" function="VREG" pad="PA08"/>
              <signal group="BGBUFREADY" index="1" function="VREG" pad="PA09"/>
              <signal group="BGBUFREADY" index="2" function="VREG" pad="PA10"/>
              <signal group="BGBUFREADY" index="3" function="VREG" pad="PA11"/>
              <signal group="BGBUFREADY" index="4" function="VREG" pad="PA12"/>
              <signal group="BGBUFREADY" index="5" function="VREG" pad="PA07"/>
              <signal group="BGBUFRRREADY" function="VREG" pad="PA04"/>
              <signal group="BIASREADY" function="VREG" pad="PB11"/>
              <signal group="BIAS_TEST_OUT" function="VREG" pad="PA06"/>
              <signal group="LDO_READY" function="VREG" pad="PB30"/>
              <signal group="ULPVREF_CLKP2" function="VREG" pad="PB14"/>
              <signal group="VCORERDY" function="VREG" pad="PB15"/>
              <signal group="VREFREADY" index="0" function="VREG" pad="PB01"/>
              <signal group="VREFREADY" index="1" function="VREG" pad="PA03"/>
              <signal group="VREFREADY" index="2" function="VREG" pad="PB31"/>
              <signal group="VREF_ANA_OUT" function="VREG" pad="PA05"/>
            </signals>
            <parameters>
              <param name="BODCORE_CALIB_MSB" value="5"/>
              <param name="BODVDD_CALIB_MSB" value="5"/>
              <param name="SUPC_OUT_NUM_MSB" value="1" caption="MSB of backup output pad Number"/>
              <param name="INSTANCE_ID" value="6"/>
            </parameters>
          </instance>
        </module>
        <module name="TC" id="U2249" version="2.0.0">
          <instance name="TC0">
            <register-group name="TC0" name-in-module="TC" address-space="base" offset="0x42003000"/>
            <signals>
              <signal group="WO" index="0" function="E" pad="PA22"/>
              <signal group="WO" index="0" function="E" pad="PB08"/>
              <signal group="WO" index="0" function="E" pad="PB12"/>
              <signal group="WO" index="1" function="E" pad="PA23"/>
              <signal group="WO" index="1" function="E" pad="PB09"/>
              <signal group="WO" index="1" function="E" pad="PB13"/>
            </signals>
            <parameters>
              <param name="CC_NUM" value="2"/>
              <param name="DMAC_ID_OVF" value="27" caption="Indexes of DMA Overflow trigger"/>
              <param name="DMAC_ID_MC0" value="28" caption="Indexes of DMA Match/Compare 0 trigger"/>
              <param name="DMAC_ID_MC1" value="29" caption="Indexes of DMA Match/Compare 1 trigger"/>
              <param name="EXT" value="0" caption="Coding of implemented extended features (keep 0 value)"/>
              <param name="GCLK_ID" value="30" caption="Index of Generic Clock"/>
              <param name="MASTER_SLAVE_MODE" value="1" caption="TC type 0 : NA, 1 : Master, 2 : Slave"/>
              <param name="OW_NUM" value="2" caption="Number of Output Waveforms"/>
              <param name="INSTANCE_ID" value="76"/>
            </parameters>
          </instance>
          <instance name="TC1">
            <register-group name="TC1" name-in-module="TC" address-space="base" offset="0x42003400"/>
            <signals>
              <signal group="WO" index="0" function="E" pad="PA24"/>
              <signal group="WO" index="0" function="E" pad="PB10"/>
              <signal group="WO" index="0" function="E" pad="PB14"/>
              <signal group="WO" index="1" function="E" pad="PA25"/>
              <signal group="WO" index="1" function="E" pad="PB11"/>
              <signal group="WO" index="1" function="E" pad="PB15"/>
            </signals>
            <parameters>
              <param name="CC_NUM" value="2"/>
              <param name="DMAC_ID_OVF" value="30" caption="Indexes of DMA Overflow trigger"/>
              <param name="DMAC_ID_MC0" value="31" caption="Indexes of DMA Match/Compare 0 trigger"/>
              <param name="DMAC_ID_MC1" value="32" caption="Indexes of DMA Match/Compare 1 trigger"/>
              <param name="EXT" value="0" caption="Coding of implemented extended features (keep 0 value)"/>
              <param name="GCLK_ID" value="30" caption="Index of Generic Clock"/>
              <param name="MASTER_SLAVE_MODE" value="2" caption="TC type 0 : NA, 1 : Master, 2 : Slave"/>
              <param name="OW_NUM" value="2" caption="Number of Output Waveforms"/>
              <param name="INSTANCE_ID" value="77"/>
            </parameters>
          </instance>
          <instance name="TC2">
            <register-group name="TC2" name-in-module="TC" address-space="base" offset="0x42003800"/>
            <signals>
              <signal group="WO" index="0" function="E" pad="PB02"/>
              <signal group="WO" index="0" function="E" pad="PB16"/>
              <signal group="WO" index="1" function="E" pad="PB03"/>
              <signal group="WO" index="1" function="E" pad="PB17"/>
            </signals>
            <parameters>
              <param name="CC_NUM" value="2"/>
              <param name="DMAC_ID_OVF" value="33" caption="Indexes of DMA Overflow trigger"/>
              <param name="DMAC_ID_MC0" value="34" caption="Indexes of DMA Match/Compare 0 trigger"/>
              <param name="DMAC_ID_MC1" value="35" caption="Indexes of DMA Match/Compare 1 trigger"/>
              <param name="EXT" value="0" caption="Coding of implemented extended features (keep 0 value)"/>
              <param name="GCLK_ID" value="31" caption="Index of Generic Clock"/>
              <param name="MASTER_SLAVE_MODE" value="1" caption="TC type 0 : NA, 1 : Master, 2 : Slave"/>
              <param name="OW_NUM" value="2" caption="Number of Output Waveforms"/>
              <param name="INSTANCE_ID" value="78"/>
            </parameters>
          </instance>
          <instance name="TC3">
            <register-group name="TC3" name-in-module="TC" address-space="base" offset="0x42003C00"/>
            <signals>
              <signal group="WO" index="0" function="E" pad="PA20"/>
              <signal group="WO" index="0" function="E" pad="PB00"/>
              <signal group="WO" index="0" function="E" pad="PB22"/>
              <signal group="WO" index="1" function="E" pad="PA21"/>
              <signal group="WO" index="1" function="E" pad="PB01"/>
              <signal group="WO" index="1" function="E" pad="PB23"/>
            </signals>
            <parameters>
              <param name="CC_NUM" value="2"/>
              <param name="DMAC_ID_OVF" value="36" caption="Indexes of DMA Overflow trigger"/>
              <param name="DMAC_ID_MC0" value="37" caption="Indexes of DMA Match/Compare 0 trigger"/>
              <param name="DMAC_ID_MC1" value="38" caption="Indexes of DMA Match/Compare 1 trigger"/>
              <param name="EXT" value="0" caption="Coding of implemented extended features (keep 0 value)"/>
              <param name="GCLK_ID" value="31" caption="Index of Generic Clock"/>
              <param name="MASTER_SLAVE_MODE" value="2" caption="TC type 0 : NA, 1 : Master, 2 : Slave"/>
              <param name="OW_NUM" value="2" caption="Number of Output Waveforms"/>
              <param name="INSTANCE_ID" value="79"/>
            </parameters>
          </instance>
