bigtreetech/BIGTREETECH-OCTOPUS-V1.0/Firmware/RepRapFirmware/RRFBuild-SourceCode/CoreN2G/src/atmel/SAMC21_DFP/1.2.176/samc21/atdf/ATSAMC21J17A.atdf
      <value-group name="TCC_EVCTRL__CNTSEL">
        <value name="START" caption="An interrupt/event is generated when a new counter cycle starts" value="0"/>
        <value name="END" caption="An interrupt/event is generated when a counter cycle ends" value="1"/>
        <value name="BETWEEN" caption="An interrupt/event is generated when a counter cycle ends, except for the first and last cycles" value="2"/>
        <value name="BOUNDARY" caption="An interrupt/event is generated when a new counter cycle starts or a counter cycle ends" value="3"/>
      </value-group>
      <value-group name="TCC_EVCTRL__EVACT0">
        <value name="OFF" caption="Event action disabled" value="0"/>
        <value name="RETRIGGER" caption="Start, restart or re-trigger counter on event" value="1"/>
        <value name="COUNTEV" caption="Count on event" value="2"/>
        <value name="START" caption="Start counter on event" value="3"/>
        <value name="INC" caption="Increment counter on event" value="4"/>
        <value name="COUNT" caption="Count on active state of asynchronous event" value="5"/>
        <value name="STAMP" caption="Stamp capture" value="6"/>
        <value name="FAULT" caption="Non-recoverable fault" value="7"/>
      </value-group>
      <value-group name="TCC_EVCTRL__EVACT1">
        <value name="OFF" caption="Event action disabled" value="0"/>
        <value name="RETRIGGER" caption="Re-trigger counter on event" value="1"/>
        <value name="DIR" caption="Direction control" value="2"/>
        <value name="STOP" caption="Stop counter on event" value="3"/>
        <value name="DEC" caption="Decrement counter on event" value="4"/>
        <value name="PPW" caption="Period capture value in CC0 register, pulse width capture value in CC1 register" value="5"/>
        <value name="PWP" caption="Period capture value in CC1 register, pulse width capture value in CC0 register" value="6"/>
        <value name="FAULT" caption="Non-recoverable fault" value="7"/>
      </value-group>
      <value-group name="TCC_WAVE__RAMP">
        <value name="RAMP1" caption="RAMP1 operation" value="0"/>
        <value name="RAMP2A" caption="Alternative RAMP2 operation" value="1"/>
        <value name="RAMP2" caption="RAMP2 operation" value="2"/>
        <value name="RAMP2C" caption="Critical RAMP2 operation" value="3"/>
      </value-group>
      <value-group name="TCC_WAVE__WAVEGEN">
        <value name="NFRQ" caption="Normal frequency" value="0"/>
        <value name="MFRQ" caption="Match frequency" value="1"/>
        <value name="NPWM" caption="Normal PWM" value="2"/>
        <value name="DSCRITICAL" caption="Dual-slope critical" value="4"/>
        <value name="DSBOTTOM" caption="Dual-slope with interrupt/event condition when COUNT reaches ZERO" value="5"/>
        <value name="DSBOTH" caption="Dual-slope with interrupt/event condition when COUNT reaches ZERO or TOP" value="6"/>
        <value name="DSTOP" caption="Dual-slope with interrupt/event condition when COUNT reaches TOP" value="7"/>
      </value-group>
    </module>
    <module name="TSENS" id="U2261" version="1.0.1" caption="Temperature Sensor">
      <register-group name="TSENS" caption="Temperature Sensor">
        <register name="CTRLA" offset="0x0" rw="RW" access="WSYNC" size="1" initval="0x00" caption="Control A Register">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
          <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
          <bitfield name="RUNSTDBY" caption="Run in Standby" mask="0x40"/>
        </register>
        <register name="CTRLB" offset="0x1" rw="W" size="1" initval="0x00" caption="Control B Register">
          <bitfield name="START" caption="Start Measurement" mask="0x1"/>
        </register>
        <register name="CTRLC" offset="0x2" rw="RW" size="1" initval="0x00" caption="Control C Register">
          <bitfield name="WINMODE" caption="Window Monitor Mode" mask="0x7" values="TSENS_CTRLC__WINMODE"/>
          <bitfield name="FREERUN" caption="Free Running Measurement" mask="0x10"/>
        </register>
        <register name="EVCTRL" offset="0x3" rw="RW" size="1" initval="0x00" caption="Event Control Register">
          <bitfield name="STARTEI" caption="Start Conversion Event Input Enable" mask="0x1"/>
          <bitfield name="STARTINV" caption="Start Conversion Event Invert Enable" mask="0x2"/>
          <bitfield name="WINEO" caption="Window Monitor Event Out" mask="0x4"/>
        </register>
        <register name="INTENCLR" offset="0x4" rw="RW" size="1" atomic-op="clear:INTENCLR" initval="0x00" caption="Interrupt Enable Clear Register">
          <bitfield name="RESRDY" caption="Result Ready Interrupt Enable" mask="0x1"/>
          <bitfield name="OVERRUN" caption="Overrun Interrupt Enable" mask="0x2"/>
          <bitfield name="WINMON" caption="Window Monitor Interrupt Enable" mask="0x4"/>
          <bitfield name="OVF" caption="Overflow Interrupt Enable" mask="0x8"/>
        </register>
        <register name="INTENSET" offset="0x5" rw="RW" size="1" atomic-op="set:INTENSET" initval="0x00" caption="Interrupt Enable Set Register">
          <bitfield name="RESRDY" caption="Result Ready Interrupt Enable" mask="0x1"/>
          <bitfield name="OVERRUN" caption="Overrun Interrupt Enable" mask="0x2"/>
          <bitfield name="WINMON" caption="Window Monitor Interrupt Enable" mask="0x4"/>
          <bitfield name="OVF" caption="Overflow Interrupt Enable" mask="0x8"/>
        </register>
        <register name="INTFLAG" offset="0x6" rw="RW" size="1" atomic-op="clear:INTFLAG" initval="0x00" caption="Interrupt Flag Status and Clear Register">
          <bitfield name="RESRDY" caption="Result Ready" mask="0x1"/>
          <bitfield name="OVERRUN" caption="Overrun" mask="0x2"/>
          <bitfield name="WINMON" caption="Window Monitor" mask="0x4"/>
          <bitfield name="OVF" caption="Overflow" mask="0x8"/>
        </register>
        <register name="STATUS" offset="0x7" rw="R" size="1" initval="0x00" caption="Status Register">
          <bitfield name="OVF" caption="Result Overflow" mask="0x1"/>
        </register>
        <register name="SYNCBUSY" offset="0x8" rw="R" size="4" initval="0x00000000" caption="Synchronization Busy Register">
          <bitfield name="SWRST" caption="Software Reset Busy" mask="0x1"/>
          <bitfield name="ENABLE" caption="Enable Busy" mask="0x2"/>
        </register>
        <register name="VALUE" offset="0xC" rw="R" size="4" initval="0x00000000" caption="Value Register">
          <bitfield name="VALUE" caption="Measurement Value" mask="0xFFFFFF"/>
        </register>
        <register name="WINLT" offset="0x10" rw="RW" size="4" initval="0x00000000" caption="Window Monitor Lower Threshold Register">
          <bitfield name="WINLT" caption="Window Lower Threshold" mask="0xFFFFFF"/>
        </register>
